Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_timer.c
    /* Need wait */
    tmpVal = BL_RD_WORD(tmpAddr);
    tmpVal = BL_RD_WORD(tmpAddr);
    tmpVal = BL_RD_WORD(tmpAddr);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  TIMER get specified channel and comparator match status
 *
 * @param  timerCh: TIMER channel type
 * @param  cmpNo: TIMER comparator ID type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type TIMER_GetMatchStatus(TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo)
{
    uint32_t tmpVal;
    BL_Sts_Type bitStatus = RESET;

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

    tmpVal = BL_RD_WORD(TIMER_BASE + TIMER_TMSR2_OFFSET + 4 * timerCh);

    switch (cmpNo) {
        case TIMER_COMP_ID_0:
            bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TMSR_0) ? SET : RESET;
            break;

        case TIMER_COMP_ID_1:
            bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TMSR_1) ? SET : RESET;
            break;

        case TIMER_COMP_ID_2:
            bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TMSR_2) ? SET : RESET;
            break;

        default:
            break;
    }

    return bitStatus;
}

/****************************************************************************/ /**
 * @brief  TIMER get specified channel preload value
 *
 * @param  timerCh: TIMER channel type
 *
 * @return Preload register value
 *
*******************************************************************************/
uint32_t TIMER_GetPreloadValue(TIMER_Chan_Type timerCh)
{
    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    return BL_RD_WORD(TIMER_BASE + TIMER_TPLVR2_OFFSET + 4 * timerCh);
}

/****************************************************************************/ /**
 * @brief  TIMER set preload register low 32bits value
 *
 * @param  timerCh: TIMER channel type
 * @param  val: Preload register low 32bits value
 *
 * @return None
 *
*******************************************************************************/
void TIMER_SetPreloadValue(TIMER_Chan_Type timerCh, uint32_t val)
{
    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    BL_WR_WORD(TIMER_BASE + TIMER_TPLVR2_OFFSET + 4 * timerCh, val);
}

/****************************************************************************/ /**
 * @brief  TIMER set preload trigger source,COMP0,COMP1,COMP2 or None
 *
 * @param  timerCh: TIMER channel type
 * @param  plSrc: TIMER preload source type
 *
 * @return None
 *
*******************************************************************************/
void TIMER_SetPreloadTrigSrc(TIMER_Chan_Type timerCh, TIMER_PreLoad_Trig_Type plSrc)
{
    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_PRELOAD_TRIG_TYPE(plSrc));

    BL_WR_WORD(TIMER_BASE + TIMER_TPLCR2_OFFSET + 4 * timerCh, plSrc);
}

/****************************************************************************/ /**
 * @brief  TIMER set count mode:preload or free run
 *
 * @param  timerCh: TIMER channel type
 * @param  countMode: TIMER count mode: TIMER_COUNT_PRELOAD or TIMER_COUNT_FREERUN
 *
 * @return None
 *
*******************************************************************************/
void TIMER_SetCountMode(TIMER_Chan_Type timerCh, TIMER_CountMode_Type countMode)
{
    uint32_t tmpval;

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_COUNTMODE_TYPE(countMode));

    tmpval = BL_RD_WORD(TIMER_BASE + TIMER_TCMR_OFFSET);
    tmpval &= (~(1 << (timerCh + 1)));
    tmpval |= (countMode << (timerCh + 1));

    BL_WR_WORD(TIMER_BASE + TIMER_TCMR_OFFSET, tmpval);
}

/****************************************************************************/ /**
 * @brief  TIMER clear interrupt status
 *
 * @param  timerCh: TIMER channel type
 * @param  cmpNo: TIMER macth comparator ID type
 *
 * @return None
 *
*******************************************************************************/
void TIMER_ClearIntStatus(TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo)
{
    uint32_t tmpAddr;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

    tmpAddr = TIMER_BASE + TIMER_TICR2_OFFSET + 4 * timerCh;

    tmpVal = BL_RD_WORD(tmpAddr);
    tmpVal |= (1 << cmpNo);

    BL_WR_WORD(tmpAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER initialization function
 *
 * @param  timerCfg: TIMER configuration structure pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TIMER_Init(TIMER_CFG_Type *timerCfg)
{
    TIMER_Chan_Type timerCh = timerCfg->timerCh;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_CLKSRC_TYPE(timerCfg->clkSrc));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCfg->timerCh));
    CHECK_PARAM(IS_TIMER_PRELOAD_TRIG_TYPE(timerCfg->plTrigSrc));
    CHECK_PARAM(IS_TIMER_COUNTMODE_TYPE(timerCfg->countMode));

    /* Configure timer clock source */
    tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCCR);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_CS_1, timerCfg->clkSrc);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_CS_2, timerCfg->clkSrc);
    }

    BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmpVal);

    /* Configure timer clock division */
    tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_TCDR2, timerCfg->clockDivision);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_TCDR3, timerCfg->clockDivision);
    }

    BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmpVal);

    /* Configure timer count mode: preload or free run */
    TIMER_SetCountMode(timerCh, timerCfg->countMode);

    /* Configure timer preload trigger src */
    TIMER_SetPreloadTrigSrc(timerCh, timerCfg->plTrigSrc);

    if (timerCfg->countMode == TIMER_COUNT_PRELOAD) {
        /* Configure timer preload value */
        TIMER_SetPreloadValue(timerCh, timerCfg->preLoadVal);

        /* Configure match compare values */
        if (timerCfg->matchVal0 > 1 + timerCfg->preLoadVal) {
            TIMER_SetCompValue(timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0 - 2);
        } else {
            TIMER_SetCompValue(timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0);
        }

        if (timerCfg->matchVal1 > 1 + timerCfg->preLoadVal) {
            TIMER_SetCompValue(timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1 - 2);
        } else {
            TIMER_SetCompValue(timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1);
        }

