Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_timer.c
    tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WICR);
    BL_WR_REG(TIMER_BASE, TIMER_WICR, BL_SET_REG_BIT(tmpVal, TIMER_WICLR));

    if (timerIntCbfArra[TIMER_WDT_IRQn - TIMER_CH0_IRQn][WDT_INT] != NULL) {
        /* Call the callback function */
        timerIntCbfArra[TIMER_WDT_IRQn - TIMER_CH0_IRQn][WDT_INT]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  TIMER install interrupt callback
 *
 * @param  timerChan: TIMER channel type
 * @param  intType: TIMER interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
void Timer_Int_Callback_Install(TIMER_Chan_Type timerChan, TIMER_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerChan));
    CHECK_PARAM(IS_TIMER_INT_TYPE(intType));

    timerIntCbfArra[timerChan][intType] = cbFun;
}

/****************************************************************************/ /**
 * @brief  Watchdog install interrupt callback
 *
 * @param  wdtInt: Watchdog interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
void WDT_Int_Callback_Install(WDT_INT_Type wdtInt, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_WDT_INT_TYPE(wdtInt));

    timerIntCbfArra[2][wdtInt] = cbFun;
}

/*@} end of group TIMER_Private_Functions */

/*@} end of group TIMER */

/*@} end of group BL602_Peripheral_Driver */
